Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK0512GC00064.atdf
          </instance>
        </module>
        <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0">
          <instance name="MCLK">
            <register-group name="MCLK" name-in-module="MCLK" address-space="base" offset="0x44012000"/>
            <parameters>
              <param name="DIV_CLK_NUM" value="1"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for MCLK"/>
              <param name="MCLK_ID_APB" value="41" caption="Index for MCLK APB clock"/>
              <param name="PAC_ID" value="9" caption="Index for MCLK registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="MPU" id="SYSTEM_IP" version="1.0.0">
          <instance name="MPU">
            <register-group name="MPU" name-in-module="MPU" address-space="base" offset="0xE000ED90"/>
            <parameters>
              <param name="__MPU_REGIONS" value="8" caption="Number of MPU regions"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" id="SYSTEM_IP" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="158" caption="Number of interrupt request lines"/>
            </parameters>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="03717" name2="osc_osc32kctrl_u2400_v2" version="2a0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x4400E000"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PB02"/>
              <signal group="XOUT32" function="XOUT32" pad="PB03"/>
            </signals>
            <parameters>
              <param name="INSTANCE_ID" value="7" caption="Instance index for OSC32KCTRL"/>
              <param name="MCLK_ID_APB" value="39" caption="Index for OSC32KCTRL APB clock"/>
              <param name="PAC_ID" value="7" caption="Index for OSC32KCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="03718" name2="osc_oscctrl_u2401_v2" version="2b0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x4400C000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PD00"/>
              <signal group="XOUT" function="XOUT" pad="PD01"/>
            </signals>
            <parameters>
              <param name="DFLL48M_ATEST_IMPLEMENTED" value="1" caption="DFLL48M ATEST register implemented"/>
              <param name="DFLL48M_ATEST_SIZE" value="8" caption="number of effective bits in DFLL48M ATEST register"/>
              <param name="DFLL48M_IS_STARTUP_OSCILLATOR" value="1" caption="DFLL48M is startup oscillator"/>
              <param name="DFLL48M_RC48MCAL0_PORVAL" value="0" caption="Defines the RC48MCAL0 register reset value after POR."/>
              <param name="DIV_8MHZ_NUM" value="2"/>
              <param name="FRACDIVS_NUM" value="1" caption="Number of FRACDIVs"/>
              <param name="FRACDIV_DIVIDER_RESET_VAL" value="32" caption="Fracdiv Divider reset value"/>
              <param name="FRACDIV_PLLSRC" value="0" caption="Indice of the PLL that is source of the FRACDIV"/>
              <param name="GCLK_ID_DFLL48M" value="0" caption="Index of Generic Clock for DFLL48"/>
              <param name="GCLK_ID_PLL" value="1" caption="Index of Generic Clock for PLL"/>
              <param name="PLLS_NUM" value="1" caption="Number of PLLs"/>
              <param name="PLL0_OUTPUTS_NUM" value="6" caption="number of clock outputs for PLL0"/>
              <param name="PLL1_OUTPUTS_NUM" value="0" caption="number of clock outputs for PLL1"/>
              <param name="USBHS_NUM" value="1" caption="Number of usbhs clock requests"/>
              <param name="XOSC_ATEST_IMPLEMENTED" value="1" caption="XOSC ATEST register implemented"/>
              <param name="XOSC_ATEST_SIZE" value="4" caption="number of effective bits in XOSC ATEST register"/>
              <param name="XOSC_CFD_CLK_SELECT_SIZE" value="4" caption="Clock fail prescaler size"/>
              <param name="XOSC_CFD_HAS_RETENTION" value="0" caption="Clock fail detected for xosc is in tetention domain"/>
              <param name="INSTANCE_ID" value="6" caption="Instance index for OSCCTRL"/>
              <param name="MCLK_ID_APB" value="38" caption="Index for OSCCTRL APB clock"/>
              <param name="PAC_ID" value="6" caption="Index for OSCCTRL registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="03585" name2="sec_pac_u2120_v2" version="2b0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x4401C000"/>
            <parameters>
              <param name="HMATRIX1_IMPLEMENTED" value="0"/>
              <param name="HPB_NUM" value="4" caption="Number of bridges AHB/APB"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Security Configuration implemented?"/>
              <param name="INSTANCE_ID" value="14" caption="Instance index for PAC"/>
              <param name="MCLK_ID_AHB" value="6" caption="Index for PAC AHB clock"/>
              <param name="MCLK_ID_APB" value="46" caption="Index for PAC APB clock"/>
              <param name="PAC_ID" value="14" caption="Index for PAC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PCC" id="03711" name2="ppi_pcc_u2017_v1" version="1c0">
          <instance name="PCC">
            <register-group name="PCC" name-in-module="PCC" address-space="base" offset="0x45018000"/>
            <signals>
              <signal group="CLK" function="K" pad="PC05" ioset="1"/>
              <signal group="DATA" index="0" function="K" pad="PC01" ioset="1"/>
              <signal group="DATA" index="1" function="K" pad="PC02" ioset="1"/>
              <signal group="DATA" index="2" function="K" pad="PC03" ioset="1"/>
              <signal group="DATA" index="3" function="K" pad="PB07" ioset="1"/>
              <signal group="DATA" index="4" function="K" pad="PB08" ioset="1"/>
              <signal group="DATA" index="5" function="K" pad="PB09" ioset="1"/>
              <signal group="DATA" index="6" function="K" pad="PB10" ioset="1"/>
              <signal group="DATA" index="7" function="K" pad="PC00" ioset="1"/>
              <signal group="DEN1" function="K" pad="PA10" ioset="1 2"/>
              <signal group="DEN1" function="K" pad="PC04" ioset="1"/>
              <signal group="DEN2" function="K" pad="PD02" ioset="1 2"/>
            </signals>
            <parameters>
              <param name="DATA_SIZE" value="14"/>
              <param name="DMAC_ID_RX" value="67"/>
              <param name="INSTANCE_ID" value="76" caption="Instance index for PCC"/>
              <param name="MCLK_ID_APB" value="108" caption="Index for PCC APB clock"/>
              <param name="PAC_ID" value="76" caption="Index for PCC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PDEC" id="03604" name2="qei_pdec_u2263_v1" version="1b0">
          <instance name="PDEC">
            <register-group name="PDEC" name-in-module="PDEC" address-space="base" offset="0x4501C000"/>
            <signals>
              <signal group="QDI" index="0" function="G" pad="PB04" ioset="1"/>
              <signal group="QDI" index="0" function="G" pad="PB07" ioset="2"/>
              <signal group="QDI" index="1" function="G" pad="PB05" ioset="1"/>
              <signal group="QDI" index="1" function="G" pad="PB08" ioset="2"/>
              <signal group="QDI" index="2" function="G" pad="PB09" ioset="2"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare Channels units"/>
              <param name="GCLK_ID" value="38" caption="Index of Generic Clocks for Synchronous Channels"/>
              <param name="INSTANCE_ID" value="78" caption="Instance index for PDEC"/>
              <param name="MCLK_ID_APB" value="110" caption="Index for PDEC APB clock"/>
              <param name="PAC_ID" value="78" caption="Index for PDEC registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="03926" name2="pwr_rpmu_pm_v1" version="1b0">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x44006000"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="1" caption="Backup domain is implemented"/>
              <param name="INSTANCE_ID" value="3" caption="Instance index for PM"/>
              <param name="MCLK_ID_APB" value="35" caption="Index for PM APB clock"/>
              <param name="PAC_ID" value="3" caption="Index for PM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="03720" name2="gpio_port_u2210_v4" version="4a0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x44800000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="64" function="default" pad="PC00"/>
              <signal group="P" index="65" function="default" pad="PC01"/>
              <signal group="P" index="66" function="default" pad="PC02"/>
              <signal group="P" index="67" function="default" pad="PC03"/>
              <signal group="P" index="68" function="default" pad="PC04"/>
              <signal group="P" index="69" function="default" pad="PC05"/>
              <signal group="P" index="70" function="default" pad="PC06"/>
              <signal group="P" index="71" function="default" pad="PC07"/>
              <signal group="P" index="73" function="default" pad="PC09"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="96" function="default" pad="PD00"/>
              <signal group="P" index="97" function="default" pad="PD01"/>
              <signal group="P" index="98" function="default" pad="PD02"/>
              <signal group="P" index="99" function="default" pad="PD03"/>
              <signal group="P" index="100" function="default" pad="PD04"/>
              <signal group="P" index="101" function="default" pad="PD05"/>
              <signal group="P" index="102" function="default" pad="PD06"/>
              <signal group="P" index="103" function="default" pad="PD07"/>
              <signal group="P" index="104" function="default" pad="PD08"/>
              <signal group="P" index="105" function="default" pad="PD09"/>
              <signal group="P" index="106" function="default" pad="PD10"/>
              <signal group="P" index="107" function="default" pad="PD11"/>
            </signals>
            <parameters>
              <param name="AHB_IMPLEMENTED" value="0"/>
              <param name="BITS" value="118"/>
              <param name="DRVSTR" value="0" caption="Number of DRVSTR bits (0/1/2)"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="4"/>
              <param name="HADDR_MSB" value="31" caption="AHB bus address MSB"/>
              <param name="IOBUS_IMPLEMENTED" value="0"/>
              <param name="MSB" value="117"/>
              <param name="ODRAIN" value="1" caption="ODRAIN supported?"/>
              <param name="PPP_IMPLEMENTED" value="0" caption="IOBUS2 implemented?"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Secure I/Os supported?"/>
              <param name="SLEWLIM" value="2" caption="Number of SLEWLIM bits (0/1/2)"/>
              <param name="INSTANCE_ID" value="32" caption="Instance index for PORT"/>
              <param name="MCLK_ID_APB" value="64" caption="Index for PORT APB clock"/>
              <param name="PAC_ID" value="32" caption="Index for PORT registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="PRM" id="03575" name2="prm_boot_ahb_v1" version="1a0">
          <instance name="PRM">
            <register-group name="PRM" name-in-module="PRM" address-space="base" offset="0x4480A000"/>
            <parameters>
              <param name="PRMWS_DEFAULT" value="0" caption="Default value of PRMWS register field"/>
              <param name="ROM_KEN" value="0" caption="Value driven on to ROM's KEN input"/>
              <param name="ROM_SPLIT" value="0x1C00" caption="Address defining first restricted address"/>
              <param name="INSTANCE_ID" value="37" caption="Instance index for PRM"/>
              <param name="MCLK_ID_AHB" value="12" caption="Index for PRM AHB clock"/>
              <param name="MCLK_ID_APB" value="68" caption="Index for PRM APB clock"/>
              <param name="PAC_ID" value="37" caption="Index for PRM registers write protection"/>
            </parameters>
          </instance>
        </module>
