Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.9/PIC32CK-GC00/atdf/PIC32CK0512GC00064.atdf
        <register name="PIDR1" offset="0xFE4" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="PIDR2" offset="0xFE8" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="PIDR3" offset="0xFEC" rw="R" size="4" access-size="4" caption="ITM Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="CIDR0" offset="0xFF0" rw="R" size="4" access-size="4" initval="0x0000000D" caption="ITM Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR1" offset="0xFF4" rw="R" size="4" access-size="4" initval="0x00000090" caption="ITM Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="CIDR2" offset="0xFF8" rw="R" size="4" access-size="4" initval="0x00000005" caption="ITM Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="CIDR3" offset="0xFFC" rw="R" size="4" access-size="4" initval="0x000000B1" caption="ITM Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="LAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
    </module>
    <module name="MCLK" id="04158" name2="clk_mclk_v1" version="1a0" caption="Main Clock">
      <register-group name="MCLK" caption="Main Clock">
        <register name="INTENCLR" offset="0x0" rw="RW" size="4" atomic-op="clear:INTENCLR" initval="0x00000000" caption="Interrupt Enable Clear">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x4" rw="RW" size="4" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="CKRDY" caption="Clock Ready Interrupt Enable" mask="0x1"/>
        </register>
        <register name="INTFLAG" offset="0x8" rw="RW" size="4" atomic-op="clear:INTFLAG" initval="0x00000001" caption="Interrupt Flag Status and Clear">
          <bitfield name="CKRDY" caption="Clock Ready" mask="0x1"/>
        </register>
        <register name="CLKDIV" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Clock Divider Control">
          <bitfield name="DIV" caption="Clock Domain Division Factor" mask="0xFF" values="CLKDIV__DIV"/>
        </register>
        <register name="CLKMSK" offset="0x3C" rw="RW" size="4" count="9" initval="0x00000000" caption="Peripheral Clock Enable Mask">
          <bitfield name="MASK" caption="Peripheral Clock Enable Mask" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="CLKDIV__DIV">
        <value name="DIV1" caption="Divide by 1" value="0x01"/>
        <value name="DIV2" caption="Divide by 2" value="0x02"/>
        <value name="DIV4" caption="Divide by 4" value="0x04"/>
        <value name="DIV8" caption="Divide by 8" value="0x08"/>
        <value name="DIV16" caption="Divide by 16" value="0x10"/>
        <value name="DIV32" caption="Divide by 32" value="0x20"/>
        <value name="DIV64" caption="Divide by 64" value="0x40"/>
        <value name="DIV128" caption="Divide by 128" value="0x80"/>
      </value-group>
    </module>
    <module name="MPU" id="SYSTEM_IP" version="1.0.0" caption="Memory Protection Unit">
      <register-group name="MPU" caption="Memory Protection Unit">
        <register name="TYPE" offset="0x0" rw="R" size="4" access-size="4" caption="MPU Type Register">
          <bitfield name="SEPARATE" caption="Separate instructions and data address regions" mask="0x1"/>
          <bitfield name="DREGION" caption="Number of MPU data regions" mask="0xFF00"/>
        </register>
        <register name="CTRL" offset="0x4" rw="RW" size="4" access-size="4" caption="MPU Control Register">
          <bitfield name="ENABLE" caption="MPU enable" mask="0x1"/>
          <bitfield name="HFNMIENA" caption="HardFault, NMI enable" mask="0x2"/>
          <bitfield name="PRIVDEFENA" caption="Privileged default enable" mask="0x4"/>
        </register>
        <register name="RNR" offset="0x8" rw="RW" size="4" access-size="4" caption="MPU Region Number Register">
          <bitfield name="REGION" caption="Selected region number" mask="0xFF"/>
        </register>
        <register name="RBAR" offset="0xC" rw="RW" size="4" access-size="4" caption="MPU Region Base Address Register">
          <bitfield name="XN" caption="Execute Never" mask="0x1"/>
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="RBAR__AP"/>
          <bitfield name="SH" caption="Shareability" mask="0x18" values="RBAR__SH"/>
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RLAR" offset="0x10" rw="RW" size="4" access-size="4" caption="MPU Region Limit Address Register">
          <bitfield name="EN" caption="Region enable" mask="0x1"/>
          <bitfield name="AttrInd" caption="Attribute Index" mask="0xE"/>
          <bitfield name="LIMIT" caption="Limit address" mask="0xFFFFFFE0"/>
        </register>
        <register name="RBAR_A" offset="0x14" rw="RW" size="4" access-size="4" count="4" caption="MPU Region Base Address Register Alias x">
          <bitfield name="XN" caption="Execute Never" mask="0x1"/>
          <bitfield name="AP" caption="Access permissions" mask="0x6" values="RBAR_A__AP"/>
          <bitfield name="SH" caption="Shareability" mask="0x18" values="RBAR_A__SH"/>
          <bitfield name="BASE" caption="Base address" mask="0xFFFFFFE0"/>
        </register>
